Repository: martinqt/GitExtensionsDoc
Catalog: source/locale/*/LC_MESSAGES/browse_repository.po
Languages: de

source: Browse Repository
de: Repository durchsuchen

source: You can browse a repository by starting Git Extensions and select the repository to open. The main window contains the commit log. You could also open the ‘Browse’ window from the shell extensions and from the Visual Studio IDE.
de: Sie können ein Repository durchsuchen indem Sie Git Extensions starten und das Repository auswählen und öffnen. Das Hauptfenster enthält das Commit-Log. Sie können auch das 'Durchsuchen' Fenster aus den Shell Erweiterungen oder aus der Visual Studio IDE auswählen.

source: View commit log
de: Commit-Log anzeigen

source: The full commit history can be browsed. There is a graph that shows branches and merges. You can show the difference between any two revisions by selecting them using ctrl-click.
de: Die vollständige Commit-Historie kann angesehen werden. Es gibt einen Graph der Branches und Merges zeigt. Sie können sich auch den Unterschied zwischen je zwei Revisionen anzeigen lassen, indem sie diese einfach per STRG+Mausklick auswählen.

source: In the context menu of the commit log you can enable or disable the revision graph. You can also choose to only show the current branch instead of showing all branches. The other options will be discussed later.
de: Im Kontextmenü des Commit-Logs können Sie den Revisionsgraphen ein- oder ausschalten. Sie können auch entscheiden nur den aktuellen Branch anstatt aller Branches anzeigen zu lassen. Auf die anderen Optionen wird später eingegangen.

source: Search or filter the commit history
de: Die Commit Historie filter oder durchsuchen

source: You can find text in the commit messages or jump to a specific commit in the current commit history shown in Git Extensions. You can also filter the commit history so that fewer commits are shown.
de: Sie können Text in den Commit Nachrichten finden oder zu einem bestimmten Commit in der aktuellen Commit Historie in Git Extensions springen. Sie können auch die Commit Historie filtern damit weniger Commits angezeigt werden.

source: Quick search in history
de: Schnellsuche in der Historie

source: You can find a commit in the commit history that is shown in Git Extensions by searching for text in the commit message, branch label or tag. This is a quick search function. Simply click into the commit history to give that pane focus and start typing. Git Extensions will show your search term in the top left corner and will immediately jump to the next commit with matching text. You can search for the next or previous commit with matching text using ``Alt-Down Arrow`` or ``Alt-Up Arrow``.
de: Sie können einen Commit in der Commit Historie finden die in Git Extensions angezeigt wird, indem sie nach einem bestimmten Text in der Commit Nachricht, einem Branch Label oder Tag suchen. Einfach in die Commit Historie klicken, damit dieses Panel den Fokus bekommt und lostippen. Git Extensions wird Ihnen den Suchbegriffen in der oberen linken Ecke anzeigen und sofort zum nächsten Commit mit dem passenden Text springen. Sie können auch nach dem nächsten oder vorigen Treffer im Text suchen mit den Tastenkombinationen ``Alt-Pfeil runter` oder ``Alt-Pfeil rauf``.

source: In ``Settings``, ``Git Extensions`` you can change the timeout for typing the text for the quick search.
de: In ``Einstellungen``, ``Git Extensions`` können Sie den Timeout verändern der bei der Testeingabe in der Schnellsuche Verwendung findet.

source: Go to a specific commit
de: Zu einem bestimmten Commit wechseln

source: You can jump to a particular commit in the commit history if you know the SHA, tag or branch. In fact you can use any expression valid for git-rev-parse. Select ``Navigate``, ``Go to commit`` or press ``Ctrl-Shift-G`` to open the ``Go to commit`` window. Enter an SHA or other term to be passed to git-rev-parse into the box at the top and click ``Go``, or select a branch or tag from one of the two combo boxes below.
de: Sie können zu einem bestimmten Commit in der Commit Historie springen wenn Sie den SHA, Tab oder Branch kennen. In der Tat können Sie jeden Ausdruck verwenden der für git-rev-parse Gültigkeit besitzt. Wählen Sie ``Navigieren``, ``Zu Commit gehen`` oder Drücken Sie die Tastenkombination ``SRTG-Shift-G``, um das Fenster ``Gehe zu Commit`` zu öffnen. Geben Sie einen SHA oder anderen Ausdruck ein der an git-rev-parse übergeben wird in die Zeile neben ``Commit Ausdruck`` oben ein und Drücken Sie auf ``Los``, oder wählen Sie einen Branch oder Tag aus einer der Combo-Boxen darunter aus.

source: Filter history
de: Historie filtern

source: The history can be filtered using regular expressions and basic filter terms. Filtering will reduce the number of commits that are shown in the Git Extensions commit history. The quick filter in the toolbar filters by the commit message, the author and/or the committer.
de: Die Historie kann mit regulären Ausdrücken oder einfach Filterausdrücken gefiltert werden. Filtern reduziert die Anzahl der Commits die in der Git Extensions Commit Historie angezeigt werden. Die Schnellfilter in der Toolbar filtern nach Commit Nachricht, dem Autor und/oder dem Comitter.

source: In the context menu of the commit log you can open the advanced filter dialog. The advanced filter dialog allows you to filter for more specific commits. To remove the filter either remove the filter in the toolbar and press enter or remove the filter in the advanced filter dialog.
de: Im Kontextmenu des Commit Logs können sie den Erweiterten Filterdialog öffnen. Der erweiterte Filterdialog erlaubt es Ihnen nach ganz bestimmten Commits zu filtern. Um den Filter zu entfernen, entfernen Sie den Filter in der Toolbar und bestätigen das mit Enter oder entfernen Sie den Filter im erweiterten Filterdialog.

source: Singe file history
de: Historie einer einzelnen Datei

source: To display the single file history, right click on a file name in the ``File tree`` or in the ``Diff`` tab and select ``File history``.
de: Um die Historie für eine einzelne Datei anzuzeigen, klicken Sie mit der rechten Maustaste auf den Dateinamen im ``Dateibaum`` oder in der Lasche ``Vergleichen`` und wählen `Datei-Historie``.

source: The single file history viewer shows all revisions of a single file. You can view the content of the file in after each commit in the ``View`` tab.
de: Die Anzeige zur Historie einer einzigen Datei zeigt alle Revisionen einer einzelnen Datei. Sie können den Inhalt der Datei in jedem Commit in der Lasche ``View`` sehen.

source: You can view the difference report from the commit in the ``Diff`` tab.
de: In der Lasche ``Diff`` sehen Sie den Report mit den Unterschieden zum Commit.

source: Added lines are marked with a ``+``, removed lines are marked with a ``–``.
de: Hinzugefügt Zeilen werden mit einen ``+`` markiert und entfernte Zeilen mit einem ``–``.

source: There is a blame function in the file history browser. It shows the last person editing a single line.
de: Es gibt eine Blame Funktion im Browser der Dateiänderungshistorie. Es zeigt den letzten Benutzer der eine einzelne Zeile geändert hat.

source: Double clicking on a code line shows the full commit introducing the change.
de: Doppelklick auf eine Codezeile zeigt den vollständigen Commit der die Änderung eingeführt hat an.
