Repository: martinqt/GitExtensionsDoc
Catalog: source/locale/*/LC_MESSAGES/integration.po
Languages: de

source: During installation you can choose to install the Visual Studio plug-in and shell extensions.
de: Während der Installation können Sie auswählen, ob Sie das Visual Studio Plugin und die Shell Erweiterungen installieren wollen.

source: There are two options in the context menu on files:
de: Es gibt zwei Optionen im Kontextmenü für Dateien:

source: View the file history by choosing the ‘File history’ option.
de: Die Änderungshistorie der Datei anzeigen lassen durch Auswahl der "Datei-Historie" Option.

source: Reset the file changes to the last committed revision.
de: Zurücksetzen der Dateiänderungen auf die zuletzt committete Revision.

source: A Git Extensions toolbar allows you to perform the most common actions.
de: Eine Git Extensions Toolbar erlaubt es Ihnen die am häufigsten verwendeten Aktionen auszuführen.

source: Commit (branch)
de: Committe (Branch)

source: Browse
de: Durchsuchen

source: Stash changes
de: Änderungen stashen

source: Settings
de: Einstellungen

source: Almost all function can be started from the ``Git`` menu in Visual Studio.
de: Fast alle Funktionen können aus dem ``Git`` Menü in Visual Studio gestartet werden.

source: The common commands can be started from Windows Explorer using the shell extensions. This option is only available when Shell Extensions are installed.
de: Die üblichen Befehle können auch aus dem Windows-Explorer heraus über die Shell Erweiterung gestartet werden. Diese Option ist nur verfügbar wenn die Shell Erweiterungen auch installiert wurden.

source: You can even create or clone a repository in any non git folder.
de: Sie können sogar in jedem nicht durch Git verwaltetem Ordner ein Repository erstellen oder klonen.
