Repository: martinqt/GitExtensionsDoc
Catalog: source/locale/*/LC_MESSAGES/maintenance.po
Languages: de

source: Maintenance
de: Wartung

source: In this chapter some of the functions to maintain a repository are discussed.
de: In diesem Kapitel werden einige der Funktionen zur Wartung des Repository diskutiert.

source: Compress Git database
de: Git Datenbank komprimieren

source: Git will create a lot of files. You can run the ``Compress git database`` to pack all small files building up a repository into one big file. Git will also garbage collect all unused objects that are older then 15 days. When a database is fragmented into a many small files compressing the database can increase performance.
de: Git wird viele Dateien erstellen. Sie können den Befehl ``Git Datenbank komprimieren`` ausführen, um alle kleinen Dateien Dateien aus denen das Repository besteht in eine große Datei zu packen. Git wird zudem alle Dateien die älter als 15 Tage sind einer Garbage Collection unterziehen und ausmisten. Wenn eine Datenbank in viele kleine Dateien fragmentiert ist, kann das komprimieren der Datenbank auch die Performance verbessern.

source: Recover lost objects
de: Verlorene Objekte wiederherstellen

source: If you accidently deleted a commit you can try to recover it using the ``Recover lost objects`` function. A dialog will show you all dangling objects and will allow you to review and recover them.
de: Wenn Sie auf Versehen einen Commit löschen, können Sie versuchen ihn mit der Funktion ``Verlorene Objekte wiederherstellen`` wiederherzustellen. Ein Dialog wird Ihnen alle verwaisten Objekte anzeigen und Ihnen erlauben diese durchzugehen und entscheiden sie wiederherzustellen.

source: Normally Git will not delete files right away when you remove something from your repository. The reason for this is that you can restore deleted items if you need to. Git will delete removed items when they are older then 15 days and you run ``Compress git database``.
de: Normalerweise wird Git Dateien nicht sofort löschen wenn Sie etwas aus Ihrem Repository entfernen. Der Grund dafür ist dass Sie gelöschte Dateien wiederherstellen können wenn dies nötig sein sollte. Git wird gelöschte Objekte ebenfalls entfernen wenn diese älter als 15 Tage sind und die Aktion ``Git Datenbank komprimieren`` verwendet wurde.

source: There are several functions to help you find the lost items. By default Git Extensions will only show commits. To show all items, just uncheck the ``Show only commits`` option. The other options can be checked/unchecked to get more/less results. Double-click on on item to view the content. When you located the item you want to recover you can tag it using the ``Tag selected object`` button.
de: Es gibt verschiedene Funktionen die Ihnen helfen verlorene Einträge zu finden. Standardmäßig zeigt Git Extensions nur Commits an. Um alle Einträge zu sehen, wählen Sie die Option ``Nur Commits anzeigen`` ab. Die anderen Optionen können an- oder abgewählt werden um mehr oder weniger Treffer im Ergebnis zu bekommen. Doppelklick auf die Einträge reicht, um den Eintrag anzuzeigen. Wenn Sie einen Eintrag lokalisiert haben der wiederherstellt werden soll, können Sie einen Tag über den Button ``Tagge ausgewähltes Objekt`` anbringen.

source: Git Extensions also is able to tag all lost objects. Doing this will make all lost objects visible again making it very easy to locate the commit(s) you would like to recover. After recovering a commit using the ``Tag all lost commits`` button, you can remove all tags using the ``Delete all LOST_AND_FOUND tags`` button.
de: Git Extensions kann auch alle verlorenen Objekte taggen. Wenn das gemacht wird, werden alle verlorenen Objekte wieder sichtbar und es wird sehr einfach den oder die Commit(s) zu lokalisieren sie Sie gerne wiederherstellen wollen. Nachdem Sie einen Commit wiederhergestellt haben können Sie über den Button ``Tagge alle verlorenen Commits`` die Tags wieder entfernen lassen mit dem Button ``Lösche alle LOST_AND_FOUND Tags``.

source: Fix user names
de: Benutzernamen bereinigen

source: When someone accidentally committed using a wrong username this can be fixed using the ``Edit .mailmap`` function. Git will use the username for an email address when it is set in the ``.mailmap`` file.
de: Wenn jemand aus Versehen unter einem falschen Benutzernamen comittet kann dies mit der Funktion ``.mailmap bearbeiten`` bereinigt werden. Git wird den Benutzernamen für eine E-Mail Adresse verwenden wenn dieser in der ``.mailmap`` Datei enthalten ist.

source: Fix user name using commit email:
de: Benutzernamen bereinigen anhand der Commit E-Mail:

source: Fix email address using commit email:
de: E-Mail Adresse bereinigen anhand der Commit E-Mail:

source: Fix email address and name using commit email:
de: E-Mail Adresse und Namen bereinigen anhand der Commit E-Mail:

source: Fix email address and name using commit name and email:
de: E-Mail Adresse und Namen bereinigen anhand des Namens und der E-Mail aus dem Commit:

source: Ignore files
de: Dateien ignorieren

source: Git will track all files that are in the working directory. Normally you do not want to exclude all files that are created by the compiler. You can add files that should be ignored to the .gitignore file. You can use wildcards and regular expressions. All entries are case sensitive. The button ``Add default ignores`` will add files that should be ignored when using Visual Studio.
de: Git überwacht alle Dateien die sich im Arbeitsverzeichnis befinden. Normalerweise würden Sie gerne alle Dateien ausschließen die vom Compiler erzeugt werden. Sie können Dateien die ignoriert werden sollen der .gitignore Datei hinzufügen. Sie können Wildcards und reguläre Ausdrücke verwenden. Bei allen Einträgen ist die Groß-/Kleinschreibung wichtig. Die Schaltfläche ``Standardmäßig Ignorierte hinzufügen`` wird alle Dateien die bei Verwendung von Visual Studio ignoriert werden sollen hinzufügen.

source: A short overview of the syntax:
de: Ein kurzer Überblick über die Syntax:

source: Lines started with ``#`` are handled as comments
de: Zeilen die mit ``#`` beginnen werden als Kommentare behandelt

source: Lines started with ``!`` are exclude patterns
de: Zeilen die mit ``!`` beginnen werden als Muster für Ausschlüsse behandelt

source: Characters inside ``[..]`` means that 1 of the characters must match
de: Zeichen innerhalb eckiger Klammern ``[..]`` bedeuten dass 1 der Zeichen stimmen muss

source: A leading slash matches the beginning of the pathname; for example, ``/*.c`` matches ``cat-file.c`` but not ``mozilla-sha1/sha1.c``
de: Ein führender Slash identifiziert den Anfang des Pfadnamens; z.B. ``/*.c`` passt auf ``cat-file.c`` aber nicht auf ``mozilla-sha1/sha1.c``

source: If the pattern ends with a slash, it is removed for the purpose of the following description, but it would only find a match with a directory. In other words, foo/ will match a directory foo and paths underneath it, but will not match a regular file or a symbolic link foo (this is consistent with the way how pathspec works in general in git).
de: Wenn das Muster mit einem Slash endet, wird dieser für den Zweck entfernt nur auf Verzeichnisse zu passen. In anderen Worten wird foo/ nur auf Verzeichnisse oder Pfade darunter zutreffen, aber nicht auf eine reguläre Datei foo oder einen symbolischen Link foo (das stimmt dann überein mit der Art und Weise wie Pfadangaben generell in Git funktionieren).

source: For more `detailed information <http://www.kernel.org/pub/software/scm/git/docs/gitignore.html>`_.
de: Für weitere `detaillierte Informationen: <http://www.kernel.org/pub/software/scm/git/docs/gitignore.html>`_.
