Repository: martinqt/GitExtensionsDoc
Catalog: source/locale/*/LC_MESSAGES/merge_conflicts.po
Languages: de

source: Merge Conflicts
de: Mergekonflikte

source: When merging branches or commits you can get merge conflicts. Git will try to resolve these, but some conflicts need to be resolved manually. Git Extensions will show warnings when there is a merge conflict.
de: Beim Mergen von Branches oder Commits kann es zu Mergekonflikten kommen. Git versucht diese automatisch aufzulösen aber manche müssen manuell aufgelöst werden. Git Extensions zeigt Warnungen an wenn ein Mergekonflikt besteht.

source: Handle merge conflicts
de: Umgang mit Mergekonflikten

source: To solve merge conflicts just click on a warning or open the merge conflict dialog from the menu. A dialog will prompt showing all conflicts. You can solve a conflict by double-click on a filename.
de: Um einen Mergekonflikt zu lösen, klicken Sie einfach auf eine Warnung oder öffnen den Mergekonflikt Dialog aus dem Menü. Ein Dialog wird angezeigt der alle Mergekonflikte anzeigt. Sie können einen Mergekonflikt lösen, indem Sie einen Dateinamen doppelklicken.

source: There are three kinds of conflicts:
de: Es gibt drei Arten von Konflikten:

source: File deleted and changed
de: Datei gelöscht und geändert

source: Use modified or deleted file?
de: Verwende geänderte oder gelöschte Datei?

source: File deleted and created
de: Datei gelöscht und erstellt

source: Use created or deleted file?
de: Verwende erstellte oder gelöschte Datei?

source: File changed both locally and remotely
de: Datei sowohl lokal als auch im Remote Repository geändert

source: Start merge tool.
de: Merge-Werkzeug starten

source: If the file is deleted in one commit and changed in another commit, a dialog will ask to keep the modified file or delete the file. When there is a conflicting change the merge tool will be started. You can configure the tool you want to use for merge conflicts. The image below shows Perforce P4Merge a free to use merge tool. Git Extensions is packaged with KDiff3, an open source merge tool.
de: Wenn die Datei in einem Commit gelöscht wird und in einem anderen Commit geändert, wird ein Dialog anfragen ob Sie die geänderte oder gelöschte Datei behalten wollen. Wenn ein Änderungskonflikt auftritt wird das Merge-Werkzeug gestartet. Sie können das Merge-Werkzeug auswählen dass für Mergekonflikte geöffnet werden soll. Das Bild unten zeigt Perforce P4Merge - ein kostenlos nutzbares Merge-Werkzeug. Git Extensions wird mit KDiff3 zusammen geliefert - einem Opensource Merge-Werkzeug für Windows.

source: In the merge tool you will see four versions of the same file:
de: Im Merge-Werkzeug werden vier Versionen derselben Datei angezeigt:

source: Base
de: Basis

source: The latest version of the file that exist in both repositories
de: Die letzte Version der Datei die in beiden Repositorys existiert.

source: Local
de: Lokal

source: The latest local version of the file
de: Die letzte lokale Version der Datei

source: The latest remote version of the file
de: Die letzte Version der Datei auf der Remote

source: Merged
de: Gemerged

source: The result of the merge
de: Das Resultat des Merge-Vorgangs

source: When you are in the middle of a merge the file named local represents your file. When you are in the middle of a rebase the file named remote represents your file. This can be confusing, so double check if you are in doubt.
de: Wenn Sie sich mitten in einem Merge-Vorgang befinden, kennzeichnet die Datei Lokal ihre Datei. Wenn Sie sich mitten in einem Rebase-Vorgang befinden, kennzeichnet die Datei namens Remote ihre Datei. Dies kann verwirrend sein also schauen Sie zweimal hin wenn Sie unsicher sind.
