Repository: martinqt/GitExtensionsDoc
Catalog: source/locale/*/LC_MESSAGES/plugins.po
Languages: de

source: List of the available plugins
de: Liste der verfügbaren Plugins

source: Auto Compile Submodules
de: Untermodule automatisch kompilieren

source: Background Fetch
de: Fetch im Hintergrund

source: Create Local Tracking Branches
de: Lokale Tracking Branches erzeugen

source: Delete Unused Branches
de: Ungenutzte Branches löschen

source: Find Large Files
de: Große Dateien finden

source: Release Notes Generator
de: Versionshinweise Generator

source: Statistics
de: Statistiken

source: This plugin permit to manage your _branching model: http://nvie.com/posts/a-successful-git-branching-model/ with _GitFlow: https://github.com/nvie/gitflow in GitExtension
de: Dieses Plugin erlaubt es Ihr _Branching Modell zu managen: http://nvie.com/posts/a-successful-git-branching-model/ mit _GitFlow: https://github.com/nvie/gitflow in GitExtensions

source: You should have GitFlow installed to use this plugin.
de: Sie müssen GitFlow insalliert haben, um dieses Plugin zu nutzen.

source: The GitFlow plugin permit to : - init gitflow in your git repository - create your feature, hotfix, release or support branch - manage (pull, publish or finish) your existing gitflow branches
de: Das Gitflow Plugin erlaubt es Ihnen: - Gitflow in Ihrem Git Repository zu initialisieren - Feature, Hotfix, Release oder Support Branch zu erstellen - Manage (Pull, Publish oder Finish) Ihrer existierenden Gitflow branches
