Repository: martinqt/GitExtensionsDoc
Catalog: source/locale/*/LC_MESSAGES/remote_feature.po
Languages: de

source: Git is a distributed source control management system. This means that all changes you make are local. When you commit changes, you only commit them to your local repository. To publish your local changes you need to push. In order to get changes committed by others, you need to pull.
de: Git ist ein verteiltes Versionskontrollsystem für Quellcode. Das bedeutet dass alle Änderungen die Sie machen lokal sind. Wenn Sie Änderungen comitten, können Sie diese nur in Ihrem lokalen Repository comitten. Um die lokalen Änderungen zu veröffentlichen, müssen Sie diese pushen. Um Änderungen die von anderen comittet wurden zu bekommen, müssen Sie pullen.

source: Manage remote repositories
de: Remote Repositorys verwalten

source: You can manage the remote repositories in the ``Remotes`` menu.
de: Sie könne die Remote Repositorys im ``Remotes`` Menü verwalten.

source: When you cloned your repository from a public repository, this remote is already configured. You can rename each remote for easy recognition. The default name after cloning a remote is ``origin``. If you use PuTTY as SSH client you can also enter the private key file for each remote. Git Extensions will load the key when needed. How to create a private key file is described in the next paragraph.
de: Wenn Sie ihr Repository von einem öffentlichen Repository gecloned haben, ist dieses Repository schon konfiguriert. Sie können jedes Remote für einfache Erkennung umbenennen. Der Standardname nach dem Klonen ist ``origin``. Wenn Sie PuTTY als SSH Client verwenden, können Sie auch einen privaten Schlüssel für jede Remote eingeben. Git Extensions wird den Schlüssel laden wenn er benötigt wird. Wie Sie einen private Schlüsseldatei erzeugen wird im nächsten Paragraph beschrieben.

source: In the ``Default pull behaviour`` tab you can configure the branches that need to be pulled and merged by default. If you configure this correctly you will not need to choose a branch when you pull or push. There are two buttons on this dialog:
de: In der ``Standard Pull Verhalten`` Lasche können Sie die Branches konfigurieren die standardmäßig gepulled und gemerged werden sollen. Wenn Sie dies korrekt konfigurieren müssen Sie keinen Branch beim Pullen oder Pushen auswählen. Es gibt zwei Buttons in dem Dialog:

source: Throw away remote branches that do not exist on the remote anymore.
de: Entferne Remote Branches die auf der Remote nicht mehr existieren.

source: Update all remote branch info
de: Update alle Remote Branch Infos

source: Fetch all remote branch information.
de: Fetch alle Remote Branch Informationen.

source: After cloning a repository you do not need to configure all remote branches manually. Instead you can checkout the remote branch and choose to create a local tracking branch.
de: Nach dem Klonen eines Repository brauchen Sie nicht alle Remote Branches von Hand konfigurieren. Stattdessen können Sie den Remote Branch auschecken und dabei einen lokalen Tracking-Branch erzeugen. Dieser verfolgt dann den Remote Branch.

source: Create SSH key
de: SSH Schlüssel generieren

source: Git uses SSH for accessing private repositories. SSH uses a public/private key pair for authentication. This means you need to generate a private key and a public key. The private key is stored on your computer locally and the public key can be given to anyone. SSH will encrypt whatever you send using your secret private key. The receiver will then use the public key you send to decrypt the data.
de: Git verwendet SSH zum Zugriff auf private Repositorys. SSH verwendet ein öffentlich/privates Schlüsselpaar zur Authentifikation. Das bedeutet Sie müssen einen privaten und öffentlichen Schlüssel generieren. Der private Schlüssel ist lokal auf Ihrem Computer gespeichert und der öffentliche Schlüssel kann jedem gegeben werden. SSH wird alles was Sie senden mit dem geheimen privaten Schlüssel verschlüsseln. Der Empfänger kann dann den öffentlichen Schlüssel dazu verwenden die Daten zu entschlüsseln.

source: This encryption will not protect the data itself but it protects the authenticity. Because the private key is only available to the sender, the receiver can be sure about the origin of the data. In practise the key pair is only used for the authentication process. The data itself will be encrypted using a key that is exchanged during this initial phase.
de: Diese Verschlüsselung schützt nicht die Daten selbst aber schützt die Authenzität. Weil der private Schlüssel nur dem Sender zur Verfügung steht, kann sich der Empfänger sicher über die Ursprungs der Daten sein. In der Praxis wird das Schlüsselpaar nur für den Authenfikationsprozess genutzt. Die Daten selbst werden dann mit einem Schlüssel verschlüsselt der in der initialen Phase ausgetauscht wird.

source: PuTTY and github
de: PuTTY und GitHub

source: PuTTY is SSH client that for Windows that is a bit more user friendly then OpenSSH. Unfortunately PuTTY does not work with all servers. In this paragraph I will show how to generate a key for github using putty.
de: PuTTY ist ein SSH Client der für Windows Benutzer etwas mehr Benutzerfreundlichkeit bietet als OpenSSH. Leider funktioniert PuTTY nicht mit allen Servern. In diesem Paragraph zeige ich wie man einen Schlüssel für GitHub mit PuTTY erzeugt.

source: First make sure GitExtensions is configured to use PuTTY and all paths are correct.
de: Zuerst überprüfen Sie, ob GIt Extensions auch für den Einsatz mit PuTTY konfiguriert wurde und alle Pfade korrekt sind.

source: can choose ``Generate or import key`` to start the key generator.
de: Sie können ``Schlüssel generieren oder importieren`` auswählen, um den Schlüsselgenerator zu starten.

source: PuTTY will ask you to move the mouse around to generate a more random key. When the key is generated you can save the public and the private key in a file. You can choose to protect the private key with a password but this is not necessary.
de: PuTTY wird Sie auffordern den Mauscursor zu bewegen, um einen Schlüssel mit etwas zufälligeren Daten generieren zu können. Wenn der Schlüssel generiert wurde können Sie den öffentlichen und privaten Schlüssel in eine Datei speichern. Sie können sich entscheiden den privaten Schlüssel mit einem Passwort zu versehen - aber dies ist nicht notwendig.

source: Now you have a key pair you need to give github the public key. This can be done in ``Account Settings`` in the tab ``SSH Public Keys``. You can add multiple keys here, but you only need one key for all repositories.
de: Jetzt haben Sie ein Schlüsselpaar und Sie müssen GitHub den öffentlichen Schlüssel übergeben. Die können Sie in den ``Account Settings`` in der Lasche ``SSH Public Keys`` erledigen. Sie können dort mehrere Schlüssel hinterlegen, aber Sie brauchen nur einen Schlüssel für alle Repositorys.

source: After telling github what public key to use to decrypt, you need to tell GitExtensions what private key to use to encrypt. In the clone dialog there is a ``Load SSH key`` button to load the private key into the PuTTY authentication agent. This can also be done manually by starting the PuTTY authentication agent and choose ``add key`` in the context menu in the system tray.
de: Nachdem Sie GitHub mitgeteilt haben welcher öffentliche Schlüssel für das Dekodieren verwendet werden soll, müssen Sie noch Git Extensions mitteilen welcher private Schlüssel für das Verschlüsseln genutzt werden soll. Im Klonen Dialog gibt es einen ``SSH Schlüssel laden`` Button mit dem der private Schlüssel im PuTTY Authenfikationsagenten geladen werden kann. Dies kann auch manuell erledigt werden, indem man den PuTTY Authentifikationsagenten startet und dann durch Auswahl von ``add key`` im Kontextmenü des Systemtrays.

source: GitExtensions can load the private keys automatically for you when communicating with a remote. You need to configure the private key for the remote.
de: Git Extension kann die privaten Schlüssel automatisch laden wenn sie für die Kommunikation mit einer Remote benötigt werden. Die müssen den privaten Schlüssel für die Remote konfigurieren.

source: This is done in the ``Manage remote repositories`` dialog.
de: Das wird im Dialog ``Remote Repositorys verwalten`` erledigt.

source: OpenSSH and github
de: OpenSSH und GitHub

source: When you choose to use OpenSSH you need to configure GitExtensions as shown in the screenshot below.
de: Wenn Sie sich entscheiden OpenSSH zu verwenden, sollten Sie Git Extensions wie auf dem Screenshot unten konfiguriert werden.

source: OpenSSH is the best SSH client there is but it lacks Windows support. Therefore it is slightly more complex to use. Another drawback is that GitExtensions cannot control OpenSSH and needs to show the command line dialogs when OpenSSH might be used. GitExtensions will show the command line window for every command that might require a SSH connection. For this reason PuTTY is the prefered SSH client in GitExtensions.
de: OpenSSH ist der beste SSH Client den es gibt aber er bietet leider keine gute Windows-Unterstützung. Deswegen ist es etwas komplexer ihn unter Windows zu verwenden. Eine weitere Einschränkung ist dass Git Extensions OpenSSH nicht kontrollieren kann und die Kommandozeilen-Fenster anzeigen muss wenn OpenSSH verwendet wird. Git Extensions wird die Kommandozeilen-Fenster für jeden Befehl der eine SSH Verbindung erfordert anzeigen. Aus diesem Grund ist PuTTY der bevorzugte SSH Client in Git Extensions.

source: To generate a key pair in OpenSSH you need to go to the command line. I recommend to use the git bash because the path to OpenSSH is already set.
de: Um ein Schlüsselpaar in OpenSSH zu erzeugen müssen Sie auf die Kommandozeile wechseln. Ich empfehle Ihnen die Git Bash zu verwenden weil der Pfad zu OpenSSH dort schon gesetzt ist.

source: Type the following command: ``ssh-keygen -C "your@email.com" -t rsa`` Use the same email address as the email address used in git. You will be asked where if you want to protect the private key with a password. This is not necessary. By default the public and private keys are stored in ``c:\Documents and Settings\[User]\.ssh\`` or ``c:\Users\[user]\.ssh\``.
de: Geben Sie den folgenden Befehl ``ssh-keygen -C "ihre@email-adresse.de" -t rsa`` ein und verwenden Sie die selbe E-Mail-Adresse wie die E-Mail-Adresse in Git. Sie werden gefragt, ob Sie ihren privaten Schlüssel mit einem Passwort schützen wollen. Das ist nicht notwendig. Standardmäßig werden Ihre öffentlichen und privaten Schlüssel in ``c:\Documents and Settings\[User]\.ssh\`` oder ``c:\Users\[user]\.ssh\`` gespeichert.

source: You do not need to tell GitExtensions about the private key because OpenSSH will load it for you. Now open the public key using notepad and copy the key to github. This can be done in ``Account Settings`` in the tab ``SSH Public Keys`` on `GitHub <http://www.github.com>`_.
de: Sie müssen Git Extensions nicht über Ihren privaten Schlüssel mitteilen weil OpenSSH diesen für Sie laden wird. Jetzt öffnen Sie den öffentlichen Schlüssel in Notepad und kopieren diesen Schlüssel zu GitHub. Dies können Sie unter ``Account Settings`` in der Lasche ``SSH Public Keys`` auf `GitHub <http://www.github.com>` erledigen.

source: Pull changes
de: Änderungen pullen

source: You can get remote changes using the pull function. Before you can pull remote changes you need to make sure there are no uncommitted changes in your local repository. If you have uncommitted changes you should commit them or stash them during the pull. You can read about how to use the stash in the Stash chapter.
de: Sie können Änderungen auf dem Remote mit der Pull Funktion holen. Bevor Sie Änderungen vom Remote holen können, müssen Sie sicherstellen, dass keine nicht-comitteten Änderungen in Ihrem lokalen Repository sind. Wenn Sie nicht-comittete Änderungen haben sollten Sie diese comitten oder während des Pulls stashen. Sie können im Kapitel Stash nachlesen wie man Stash genau verwendet.

source: In order to get your personal repository up-to-date, you need to fetch changes from a remote repository. You can do this using the ``Pull`` dialog. When the dialog starts the default remote for the current branch is set. You can choose another remote or enter a custom url if you like. When the remote branches configured correctly, you do not need to choose a remote branch.
de: Um Ihr persönliches Repository auf den neuesten Stand zu bringen, müssen Sie Änderungen vom Remote Repository abholen. Verwenden Sie den ``Pull`` um das zu erledigen. Wenn der Dialog startet ist die Standard Remote für den aktuellen Branch schon gesetzt. Sie können ein anderes Remote auswählen oder eine benutzerdefinierte URL eingeben wenn Sie wollen. Wenn der Remote Branch korrekt konfiguriert wurde, brauchen Sie keinen Remote Branch auswählen.

source: If you just fetch the commits from the remote repository and you already committed some changes to your local repository, the commits will be in a different branch. In the pull dialog this is illustrated in the image on the left. This can be useful when you want to review the changes before you want to merge them with your own changes.
de: Wenn Sie nur die Commits vom Remote Repository per Fetch holen und schon einige Änderungen in Ihrem lokalen Repository comittet haben werden diese in einem anderen Branch sein. Im Pull Dialog wird das im Bild auf der linken Seite illustriert. Dies kann nützlich sein wenn Sie die Änderungen begutachten wollen bevor Sie diese mit Ihren eigenen Änderungen mergen wollen.

source: When you choose to merge the remote branch after fetching the changes a branch will be created, and will be merged you’re your commit. Doing this creates a lot of branches and merges, making the history harder to read.
de: Wenn Sie entscheiden den Remote Branch zu mergen nachdem Sie die Änderungen abgeholt haben, wird ein neuer Branch erstellt und mit Ihrem Commit gemergt. Wenn Sie das machen generiert dies viele Branches und Merges was die Historie schwerer lesbar macht.

source: Instead of merging the fetched commits with your local commits, you can also choose to rebase your commits on top of the fetched commits. This is illustrated on the left in the image below. A rebase will first undo your local commits (c and d), then fetch the remote commits (e) and finally recommit your local commits. When there is a merge conflict during the rebase, the rebase dialog will show.
de: Anstatt die geholten Änderungen mit Ihren lokalen Commits zu mergen, können Sie sich auch entscheiden ihre Commits auf den geholten Commits zu rebasen. Dies wird illustriert im Bild unten auf der Linken. Ein Rebase wird zuerst Ihre lokalen Commits zurücknehmen (c und d), dann die Remote Commits (e) holen und letztendlich Ihre lokalen Commits darauf wieder committen. Wenn es einen Mergekonflikt während des Rebase Vorgangs wird der Rebase Dialog angezeigt.

source: Next to the pull button there are some buttons that can be useful:
de: Neben dem Pull Button gibt es mehrere Buttons die nützlich sein können:

source: Solve conflicts
de: Konflikte lösen

source: When there are merge conflicts, you can solve them by pressing this button.
de: Wenn es Mergekonflikte gibt können Sie diese lösen indem sie diesen Button drücken.

source: Stash changes
de: Änderungen stashen

source: When the working dir contains uncommitted changes, you need to stash them before pulling.
de: Wenn das Arbeitsverzeichnis nicht-comittete Änderungen enthält, müssen Sie diese vor dem nächsten Pullen stashen.

source: Auto stash
de: Automatisch Stashen

source: Check this checkbox if you want to stash before pulling. The stash will be reapplied after pulling.
de: Hake diese Checkbox an wenn Sie vor dem Pullen Stashen wollen. Der Stash wird nach dem Pull automatisch wieder angewendet.

source: Load SSH key
de: SSH Schlüssel laden

source: This button is only available when you use PuTTY as SSH client. You can press this button to load the key configured for the remote. If no key is set, a dialog will prompt for the key.
de: Dieser Button ist nur verfügbar wenn Sie PuTTY als SSH Client verwenden. Sie können diesen Button drücken, um den Schlüssel für diese Remote zu konfigurieren. Wenn kein Schlüssel gesetzt ist wird ein Dialog angezeigt der den Schlüssel abfragt.

source: Push changes
de: Änderungen pushen

source: In the browse window you can check if there are local commits that are not pushed to a remote repository yet. In the image below the green labels mark the position of the master branch on the remote repository. The red label marks the position of the master branch on the local repository. The local repository is ahead three commits.
de: Im Durchsuchen Fenster können Sie prüfen wenn es lokale Commits gibt die noch nicht in ein Remote Repository gepusht wurden. In dem Bild unten markieren die grünen Labels die Position des master Branch auf dem Remote Repository. Das rote Label zeigt die Position des master Branch auf dem lokalen Repository. Das lokale Repository ist drei Commits voraus.

source: To push the changes press ``Push`` in the toolbar.
de: Um die Änderungen zu pushen drücken Sie ``Push`` in der Toolbar.

source: The push dialog allows you to choose the remote repository to push to. The remote repository is set to the remote of the current branch. You can choose another remote or choose a url to push to. You can also specify a branch to push.
de: Der Push Dialog erlaubt es Ihnen das Remote Repository auszuwählen in das gepusht werden soll. Das Remote Repository ist auf das Remote Repository des aktuellen Branches gesetzt. Sie können andere Remotes auswählen oder eine URL bestimmen zu der gepusht werden soll. Die können auch den Branch angeben der gepusht wird.

source: Tags are not pushed to the remote repository. If you want to push a tag you need to open the ``Tags`` tab in the dialog. You can choose to push a singe tag or all tags. No commits will be pushed when the ``Tags`` tab is selected, only tags.
de: Tags werden nicht auf das Remote Repository gepusht. Wenn Sie einen Tag pushen wollen, müssen Sie die ``Tags`` Lasche im Dialog öffnen. Sie können einen einzelnen Tag oder alle Tags zum Pushen auswählen. Wenn die Lasche ``Tags`` ausgewählt ist werden keine Commits sondern nur Tags gepusht.

source: You can not merge your changes in the remote repository. Merging must be done locally. This means that you cannot push your changes before the commits are merged locally. In practice you need to pull before you can push most of the times.
de: Sie können Ihre Änderungen nicht in das Remote Repository mergen. Das Mergen muss lokal erfolgen. Das bedeutet dass Sie Ihre Änderungen nicht pushen können bevor die Commits lokale gemergt wurden. In der Praxis müssen sie in den allermeisten Fällen immer erst pullen bevor Sie pushen können.
